#+TITLE: 
#+AUTHOR: 
#+EMAIL: 
#+DATE: 2026-03-04T23:15:10Z UTC 
#+LANGUAGE:  en 
#+EXPORT_FILE_NAME: SML1.html
# --- Configurations ---
#+SETUPFILE: /home/galaxybeing/Dropbox/org/tufte-html-setup.org
#+SETUPFILE: /home/galaxybeing/Dropbox/org/math-latex-setup.org
# --- Configurations ---
#+SETUPFILE: /home/galaxybeing/Dropbox/org/tufte-html-setup.org
#+SETUPFILE: /home/galaxybeing/Dropbox/org/math-latex-setup.org
# --- Bibliography ---
#+bibliography: /home/galaxybeing/Dropbox/org/biblio/ref.bib
#+cite_export: csl
# --- Document Content Starts Here ---
#+INCLUDE: /home/galaxybeing/Dropbox/org/codeismathiscode2/header.org :minlevel 1


* Standard ML 1
:PROPERTIES:
:TIME:     2020-03-22T19:47:16
:ID:       0d2b1aaa-acdf-433b-ad0f-d3200246160c
:EDGES:
:END:

** Not exported                                                   :noexport:

#+begin_src sml :eval never :exports code :tangle sml1.sml :noweb yes




#+end_src





** Testing                                                       :noexport:

#+BEGIN_SRC sml :session *sml* :results output
val addOne = fn n => n + 1;
#+END_SRC

#+RESULTS:
: val it = "stdIn" : string


An exponentiation, power-of function

#+begin_src sml :session *sml* :results output
fun pow base 0 = 1
  | pow base exp = base * pow base (exp - 1);

val result1 = pow 2 3;
val result2 = pow 5 4;
#+end_src

#+RESULTS:
: val result1 = 8 : int

#+begin_src sml :results output :session *sml*
fun pow2 (base : int) 0 : int = 1
  | pow2 (base : int) (exp : int) : int = base * pow2 base (exp - 1);

val result = pow2 2 3;
#+end_src

#+RESULTS:
: val result = 8 : int

#+begin_src sml :results output :session *sml*
fun pow4 (x : int) (y : int) =
    if y = 0
    then 1
    else x * pow4 x (y-1); (* <-- Add this if typing directly in the REPL *)
#+end_src



#+begin_src sml :session *sml* :results output
fun factorial 0 = 1
  | factorial n = n * factorial (n - 1);

val result = factorial 5;
#+end_src

#+RESULTS:
: val result = 120 : int

#+name: 9d952c5d-b1c8-4698-bba0-74c616af03f4
#+begin_src sml :session *sml* :results output verbatim :exports both
val myNumbers = [1, 2, 3, 4, 5];

val incrementedNumbers = List.map (fn n => n + 1) myNumbers;
#+end_src

#+RESULTS: 9d952c5d-b1c8-4698-bba0-74c616af03f4
: val myNumbers = [1,2,3,4,5] : int list
: 
: [autoloading]
: [library $SMLNJ-BASIS/basis.cm is stable]
: [library $SMLNJ-BASIS/(basis.cm):basis-common.cm is stable]
: [autoloading done]
: val incrementedNumbers = [2,3,4,5,6] : int list

#+name: f4251bed-aa87-4d7a-bd53-368b78cab7a0
#+begin_src sml :session *sml* :results output verbatim :exports both
incrementedNumbers;
#+end_src

#+RESULTS: f4251bed-aa87-4d7a-bd53-368b78cab7a0
: val it = [2,3,4,5,6] : int list



#+begin_src sml :session *sml* :results output :exports both :var multiplier=10
val baseNumbers = [1, 2, 3];
val scaledNumbers = List.map (fn n => n * multiplier) baseNumbers;
#+end_src

#+RESULTS:
: val multiplier = 10 : int
: val baseNumbers = [1,2,3] : int list
: val scaledNumbers = [10,20,30] : int list


#+name: my-table
| 1 | 2 |
| 3 | 4 |

#+begin_src sml :session *sml* :results output :exports both :var data=my-table
val flatData = List.concat data;
#+end_src

#+RESULTS:
: val data = [[1,2],[3,4]] : int list list
: val flatData = [1,2,3,4] : int list

** Expressions versus commands: the conceptual shift

*** The imperative model (C/C++): controlling the machine

C and its sister language C++ (C/C++) are modeled heavily on the
physical architecture of the computer (specifically, the von Neumann
architecture). When you program in C/C++ you are effectively issuing
step-by-step commands to directly change the state of the computer's
memory.

- **Variables as memory boxes:** In C/C++, a variable is a named box
  in memory.
- **Commands as mutations:** A statement like =x = x + 1;= is a
  command.[fn:1] It means: "Go to the memory box named =x=, read the
  current value, add ~1~ to it, and overwrite the contents of that
  exact same box with the new value."

#+BEGIN_SRC c
int x = 5;
x = x + 1;
// The state of 'x' is now permanently altered to 6
// The previous state of x = 5 is gone forever
#+END_SRC

The execution of a C/C++ program is a timeline of state changes. To
understand what the program is doing at, say, line 50, you have to
mentally track the current state of all the mutated "boxes" from lines
1 through 49.[fn:2]

*** The functional model (ML family): reducing expressions

SML[fn:3] is not modeled on hardware architecture, rather, on
mathematical logic. When we program in an ML language we do not write
commands to change memory; we write expressions to be evaluated, and
running an SML program is much like simplifying an algebraic equation.

- **Variables as definitions:** In SML, a variable is not a box in
  memory; it is a mathematical definition. If you write =x = 5=, you
  are /binding/ ~5~ to ~x~. You are stating a truth: "In this scope,
  =x= is exactly and forever ~5~."
- *Evaluation as Substitution:* If you have a function =f y = y + 1=
  and you evaluate =f x=, the program simply substitutes =x= with 5,
  evaluating =5 + 1= to =6=.

#+name: fa965987-b1b3-4f20-87f2-5a6edbb61b75
#+begin_src sml :session *sml* :results output verbatim :exports both
let
  val x = 5
  fun f y = y + 1
in
  print ("f x = " ^ Int.toString (f x) ^ "\n" ^ "x = " ^ Int.toString x ^ "\n")
end
#+end_src

#+RESULTS: fa965987-b1b3-4f20-87f2-5a6edbb61b75
: f x = 6
: x = 5
: val it = () : unit

The number ~5~ did not /become/ 6. The original value was not destroyed
or mutated. Instead, a brand new value (=6=) was produced as the
result of the expression. This is "pure functional
statelessness"—immutability. Because values never change once defined,
an expression evaluated with the same inputs will always yield the
exact same result, with no hidden dependencies on an external,
shifting timeline of memory states.

*** The Compiler's Magic Trick
If Haskell programs are just pure, stateless mathematical equations,
how does the computer actually do the work?

This is where the compiler and the runtime system come in. The Haskell compiler takes your pure, stateless mathematical logic and translates it into the highly stateful, messy, imperative machine code required by the CPU. 

- When you evaluate an expression to a new value, the Haskell runtime silently allocates new memory for that value behind the scenes.
- When old values are no longer needed for any further equations, the runtime's "garbage collector" silently reclaims that memory.

In C, /you/ manage the state. In Haskell, you work in a pure mathematical domain, and the /runtime system/ handles the dirty work of managing the physical state of the hardware. 

You have hit the absolute bullseye. Yes, to all of your questions. 

In SML, =fun f y = y + 1= is nothing more than convenient syntactic sugar for =val f = fn y => y + 1=. Underneath the hood, *all functions in SML are just anonymous lambda functions bound to variable names.*

Here is why this design choice is so profound, what its purpose is, and how it forms the direct bridge to mathematical logic.

*** 1. The Purpose: Complete Uniformity
If you define =val x = 5=, you are binding the integer value =5= to the name =x=. 
If you define =val f = fn y => y + 1=, you are doing the exact same thing: binding a function value (a closure) to the name =f=. 

By making =fun= just a shorthand for =val= + =fn=, the language enforces that *functions are not special control structures* (as they are in C). They are just values, no different from integers, strings, or lists. Because they are just values, you can naturally pass them as arguments to other functions, return them from functions, or store them in data structures. It makes the entire language beautifully uniform.

*** 2. The Direct Link to Lambda Calculus
You have discovered the exact theoretical foundation of functional programming. Languages like SML, Haskell, and Scheme are not based on the Turing machine model of memory mutation; they are direct, executable implementations of *Alonzo Church’s lambda calculus*.

In lambda calculus, there are only three fundamental operations:
1. *Variables:* $x, y, z$
2. *Abstraction (Function creation):* $\lambda y . y + 1$ 
3. *Application (Function calling):* $(\lambda y . y + 1)\ 5$



SML's syntax is a nearly 1-to-1 mapping of this logic:
- The lambda symbol ($\lambda$) becomes the =fn= keyword.
- The dot ($.$) becomes the thick arrow (=>), establishing the mapping $y \mapsto y + 1$.
- Function application is just writing them next to each other: =f x=.

*** 3. Computability and Type Theory
This is not just an academic curiosity; it dictates what the computer can actually calculate. In computability theory, the lambda calculus is proven to be Turing-complete. This means that merely by substituting variables into anonymous functions, you can compute anything that a C program can compute with pointers and mutable state. 

Furthermore, when you add a rigorous type system on top of this (like SML's strongly typed integers, lists, and function types), you enter the realm of typed lambda calculi. The expressions you evaluate are no longer just running code; under the Curry-Howard correspondence, they map directly to constructive proofs in first-order logic. Evaluating the expression is equivalent to verifying the proof.

By treating all functions as anonymous lambdas bound to values, SML strips away the hardware-level mechanics of the computer and lets you program directly in the domain of pure mathematical logic.

*** 4. Tossing a Lambda into Fold (Reduce)
Now, let us look at how we toss a lambda into a =fold= (or "reduce") function to sum up an entire list of numbers. 

In SML, =fold= comes in two main flavors: =foldl= (fold left) and =foldr= (fold right). They both take a function, an initial accumulator value, and a list.

Let's use =foldl= to sum the list =[1, 2, 3, 4, 5]=. We will pass in an anonymous lambda function that takes a tuple =(element, accumulator)= and adds them together:

#+BEGIN_SRC sml
let
  val numbers = [1, 2, 3, 4, 5]
in
  foldl (fn (x, acc) => x + acc) 0 numbers
end
#+END_SRC



Here is what is happening mathematically:
1. The =foldl= function takes our initial accumulator =0= and the first element =1=. It applies the lambda: $(1, 0) \mapsto 1 + 0 = 1$.
2. It takes the new accumulator =1= and the next element =2=. Applies the lambda: $(2, 1) \mapsto 2 + 1 = 3$.
3. It takes the new accumulator =3= and the next element =3=. Applies the lambda: $(3, 3) \mapsto 3 + 3 = 6$.
...and so on, until the list is empty, returning the final accumulated value of =15=.

If we were to write our own =foldl= from scratch using pattern matching, it would look like this:

#+BEGIN_SRC sml
fun myFoldl f acc [] = acc
  | myFoldl f acc (x::xs) = myFoldl f (f (x, acc)) xs
#+END_SRC

Notice how our recursive step =myFoldl f (f (x, acc)) xs= explicitly applies our function =f= to the current element =x= and the accumulator =acc=, and passes that newly evaluated value down as the accumulator for the next recursive call. This completely eliminates the need for stateful, mutating loops!

---

Would you like me to demonstrate how to implement a right-fold (=foldr=) next, to see how it builds an expression tree compared to =foldl='s iterative accumulation?





With SML you do not issue commands. Instead we /compose/ expressions,
we /evaluate/ expressions. The difference between composing
expressions and issuing commands as with an imperative language is
like the difference between a **recipe**: first do A, then do B, and a
**mathematical formula**: evaluate B and C for a value, then evaluate
A with that composed value. A command changes the state of the
computer directly, while evaluating expressions is on a layer of
abstraction above state changes.

*** Definition of an expression in SML

@@html:<font color = "#0d3db3">@@ ⥤ In SML, an **expression** is a
syntactic construct that can be evaluated to produce a **value**.
@@html:</font>@@

This means programs in SML are made up of expressions that are
evaluated to give values. What is an expression? Simply put, any
section of code that can be evaluated to produce a value.[fn:4]

SML expressions are related to [[https://en.wikipedia.org/wiki/Expression_(mathematics)][mathematical expressions]]. Consider this
math equation

\begin{align*}
7x - 5 = 2
\end{align*}

The two parts on either side of the equals sign, $7x - 5$ as well as
the $2$, are expressions, while the whole equation itself, $7x - 5 =
2$, is not typically considered an expression, rather, a formula or an
equation. Why?  Again, per definition, $7x - 5$ by itself can be
resolved to a value (if we plug a number into $x$), while $2$ is
automatically an expression because it resolves to itself.

@@html:<font color = "#0d3db3">@@⥤ To /evaluate/ an expression means
to find a value equivalent to the expression.  @@html:</font>@@

In math this is /reducing to simplest form/.[fn:5] For our $7x - 5 =
2$ example, by plugging in $x = 1$ to the expression $7x - 5$, it
evaluates to $2$. But can't we then say the equation as a whole
evaluates to the Boolean value of true? Yes and no. In just the form
of $7x - 5 = 2$ we have no resolution.

But why is $2$ an expression? Because anything in the form of a
value can be said to evaluate to itself. This is a universal
convention of mathematics. If we simply feed possible values---

#+name: f2199dbb-9457-45c8-9dda-8cbfa471273c
#+begin_src sml :session *sml* :results output :exports both
47;
true;
use;
#+end_src

#+RESULTS: f2199dbb-9457-45c8-9dda-8cbfa471273c
: val it = 47 : int
: val it = true : bool
: val it = fn : string -> unit

Again, a value is an expression that has been fully evaluated to its
normal (simplest) form. It cannot be reduced any further. For example,
the expression $40 + 7$ evaluates to the value $47$. So if we now
evaluate $47$ --- which is already a value because it is in normal
form --- we must get that normal form value back. Notice the results
reads ~val it = 47 : int~ Here the REPL environment has bound the
normal form value ~47~ to the generic variable ~it~

#+name: 5602e2ae-773b-4d9f-90e3-125975dc68e6
#+begin_src sml :session *sml* :results output :exports both
47;
#+end_src

#+RESULTS: 5602e2ae-773b-4d9f-90e3-125975dc68e6
: val it = 47 : int

#+name: 9bda7023-c5cd-40ef-981d-c054948e0915
#+begin_src sml :session *sml* :results value :exports both
it + 1;
#+end_src

#+RESULTS: 9bda7023-c5cd-40ef-981d-c054948e0915
: val it = 49 : int




has a generic variable ~it~ to which a value


*** Composing versus nesting

Another way of contrasting imperative versus functional programming is
how code is embedded in code. Imperative programming /nests logic/
while functional /composes expressions/

- **Nesting Logic:** Placing procedure code inside procedure code to
  control the flow of execution. The focus is on the order of the
  imperative commands as it changes state.
- **Composing Expressions:** Building a result by combining smaller
  results. The focus is on the __result's definition__. Consider this

#+name: 547ba348-8ae1-4f90-a9f4-42bf876c3496
#+begin_src sml :session *sml* :results output :exports both
(* Composing small expressions into a larger one *)
val result = (1 + 2) * (Int.max(5, 10));
#+end_src

#+RESULTS: 547ba348-8ae1-4f90-a9f4-42bf876c3496
: val result = 30 : int

Here, ~(1 + 2)~ is an expression, ~Int.max(5, 10)~ is an
expression,[fn:6], while the times operator ~*~ /composes/ them into a
larger expression. Then this value is bound to the variable phrase
~result~ /However, the entire line ~val result = (1 + 2) * (Int.max(5,
10));~ itself is a **declaration** that contains expressions/. Let's
take a closer look at this distinction. Unlike the formula above, a
declaration can never be an expression. Here's a simple SML
/declaration/

#+name: f3c9c34c-e1b4-4125-b03d-e05e357838c0
#+begin_src sml :session *sml* :results output :exports both
val x = 34;
#+end_src

#+RESULTS: f3c9c34c-e1b4-4125-b03d-e05e357838c0
: val x = 34 : int

- **Expressions** ($e$) compute and evaluate to a typed value. They
  /do not/, by themselves, introduce new names (e.g., ~x~, ~y~,
  ~result~) into the global scope.
- **Declarations** ($d$) modify the environment by binding
  identifiers (e.g., ~z~, ~f~, ~myvrbl~) to the results of evaluated
  expressions. Again, they do not evaluate to a value in the same way an
  expression does; instead, /they produce a new environment/. Here,
  ~x~ is introduced to the SML system as an immutable variable.

As we see above, the ~val x = 34;~ declaration "at the top level",
i.e., in the REPL, "returns" ~val x = 34 : int~ as a sort of recipe
for making ~x~ available.

~val x = 34~ is a /variable binding/. Do not think of this as an
/assignment/. In imperative languages like C/C++ an assignment of a
number ~34~ to a variable ~x~ establishes ~x~ as a name for an
internal place in memory, which can subsequently be /assigned/ a
different number by the program, overriding the original ~34~. This is
not the case with SML. If later in an SML session we declare ~val x =
38;~ we would have literally created a new ~x~ that now has the value
~38~. This means there are now two completely separate ~x~'s. This is
called "shadowing", i.e., some parts of my program might be working
with the original ~x~ while others with the second ~x~ --- i.e., this
is undesirable.

The code below shows a /sequence/ of bindings

#+begin_src sml :session *sml* :results output :exports both
val x = 34; (* simplest expression is an integer constant *)
val y = 17; (* variable binding *)
val z = (x + y) + (y + 2);
(* dynamic environment: x --> 34, y --> 17 ==> z --> 70 *)
val abs_of_z = if z < 0 then 0 - z else z;
#+end_src

#+RESULTS:
: val x = 34 : int
: val y = 17 : int
: val z = 70 : int
: val abs_of_z = 70 : int

Do not think of these as statements. Imperative languages (C, Java,
Python) have statements, while SML has almost none. In imperative
languages, an ~if~ or a ~for~ loop is a statement that ***does
something*** directly to the state of the program in memory but
returns nothing. In SML, expressions return values. For example, with
a /conditional/ ~if ... then ... else~

- **statement (Imperative):** ~if (x > 0) { print("hi"); }~ ...if ~(x
  > 0)~ is true this carries out the print and returns nothing,
- **expression (SML):** ~if x > 0 then "hi" else "bye"~  ...returns a
  string, i.e., a value.




*** Connection to Abstract Syntax Trees (AST)

Because SML is expression-oriented, the code maps almost 1-to-1 to an
**AST**.

In an AST:

- **Leaves:** Constants (34, "hello") and Variables (x, y).
- **Nodes:** Operators or Function calls that take child expressions
  as sub-trees and produce a new value.

In SML, the "program" is just one giant AST node that evaluates down
to a final result. This is why "nesting" is a misleading term --- you
aren't nesting instructions; you are building a tree of definitions.

*** 4. Comparison Table


| Feature | Imperative Statement | SML Expression |
|---------+----------------------+----------------|
| Goal    | Change state/action  | Produce a value |
| Result  | ~void~ or ~unit~      | A specific type |
| Context | Control Flow         | Data Transformation |
| AST     | Sequential Nodes     | Functional Tree |

*** 5. The "Everything is an Expression" Rule

In SML, even things that look like blocks are expressions:

#+name: b9be8b2b-d215-4d0b-8dc9-3613da544252
#+begin_src sml :session *sml* :results output :exports both
val z = let val x = 10 in x + x end; 
(* The 'let...in...end' block is a single expression evaluating to 20 *)
#+end_src

#+RESULTS: b9be8b2b-d215-4d0b-8dc9-3613da544252
: val z = 20 : int



- **Immutability**: A binding creates a fixed link between a name
  (e.g., ~x~) and a value (~34~). Once bound, the value of that
  specific ~x~ cannot be changed.
- **Shadowing**: If you type val ~x = 50~ into the REPL later, you
  aren't changing the old ~x~, you are creating a new binding that
  "shadows" (hides) the previous one in the current scope.
- **Assignment**: Actual assignment in SML is only possible using
  reference cells (e.g., ~val x = ref 34~), where you use the :=
  operator to update the contents of a memory location.

In SML, *binding* and *assignment* are distinct concepts. A standard ~val~ 
binding is immutable; you can only "change" it by shadowing the name with 
a completely new binding. Which is confusing, so don't do it.

***** Shadowing (Immutable Bindings)
Shadowing creates a new environment entry rather than updating an existing one.
Existing functions continue to use the binding that was in scope when they 
were defined. For example

#+name: c6997bbb-910d-41f1-8fd2-3fd1e842fb8d
#+begin_src sml :session *sml* :results output :exports both
val x = 10;
fun getX () = x;

(* Shadowing x with a new binding *)
val x = 20;

val shadowed_result = x;        (* Evaluates to 20 *)
val function_result = getX (); (* Still evaluates to 10 *)
#+end_src

#+RESULTS: c6997bbb-910d-41f1-8fd2-3fd1e842fb8d
: val x = 10 : int
: val getX = fn : unit -> int
: val x = 20 : int
: val shadowed_result = 20 : int
: val function_result = 10 : int

***** Reference updates---like with blub languages

Reference cells allow you to update the value stored in a memory location 
using the ~:=~ operator.

#+begin_src sml
val r = ref 10;
fun getR () = !r; (* The ! operator dereferences the cell *)

(* Actual assignment/mutation *)
r := 20;

val assigned_result = !r;      (* Evaluates to 20 *)
val function_result = getR (); (* Now evaluates to 20 *)
#+end_src

#+RESULTS:
: val function_result = 20 : int


$\mathfrak{Fazit}$: Don't bother with reference/dereference updating
unless you absolutely must. Normal variable immutability is a
/feature/ of functional programming.[fn:7]

In functional programming everything is based on functions We'll look
at


**** How Recursion Replaces Iteration

In functional programming, you do not use ~for~ or ~while~ loops to change a 
counter. Instead, you use **recursion** to pass the "new state" as an argument 
to the next function call.

***** 1. The Anatomy of a Functional "Loop"
A recursive function replaces the three parts of a traditional loop:
- **Initialization:** The initial arguments passed to the function.
- **Condition:** The **Base Case** (e.g., checking for an empty list).
- **Advancement:** The recursive call with a modified value (the "step").

***** 2. Tail Recursion (The "Efficient" Loop)
SML optimized **tail-recursive** functions to run as efficiently as 
imperative loops. A function is tail-recursive if the 
recursive call is the absolute last action it performs.


#+name: 3990d8e9-5d67-4c90-acdc-932f81262a42
#+begin_src sml :session *sml* :results output :exports both
(* Imperative-style thinking: sum a list *)
(* In a loop, you'd have: total = 0; for x in list: total += x *)

fun sum_list (nums: int list, acc: int) =
    case nums of
        []      => acc               (* Base Case: Loop is finished *)
      | (x::xs) => sum_list (xs, x + acc) (* Advancement: Next "iteration" *)

val result = sum_list ([1, 2, 3, 4], 0); (* result is 10 *)
#+end_src

***** 3. Why Recursion?
- **No Mutation:** You never actually change the value of ~acc~; you just 
  provide a *new* value for the *next* function's ~acc~.
- **Immutability:** Each "iteration" has its own unique, immutable scope.
- **Structural Match:** Recursion naturally follows the shape of data 
  structures like lists and trees.



#+name: e01aa86c-2ded-470f-a720-1baab7954197
#+begin_src sml :session *sml* :results output :exports both
fun pow (x:int, y:int) = (* correct only for y >= 0 *)
    if y=0
    then 1
    else x * pow(x,y-1)
#+end_src

#+RESULTS: e01aa86c-2ded-470f-a720-1baab7954197
: val pow = fn : int * int -> int

#+name: 3e2d0ac8-f8af-457e-aaef-3f30b0db127c
#+begin_src sml :session *sml* :results output :exports both
pow (3,2)
#+end_src

#+RESULTS: 3e2d0ac8-f8af-457e-aaef-3f30b0db127c
: val it = 9 : int



In Standard ML (and many other functional languages), the =*= in a
type signature denotes a **tuple type**, which is the direct
programming equivalent of a mathematical Cartesian product.

Here is a breakdown of how the math maps to the code:

- *The Math* ($N \times N$): The Cartesian product of two sets, representing the set of all ordered pairs $(x, y)$ where both $x$ and $y$ are natural numbers.
- *The Code* (=int * int=): The tuple type representing all possible pairs of integers in SML, written as =(x, y)=.



Because of this Cartesian product, a function with the signature =int * int -> int= actually only takes *one* argument. That single argument just happens to be a 2-tuple (a pair) containing two integers.[fn:8]

For example, an addition function with this signature would look like this:

#+BEGIN_SRC sml
fun add (x, y) = x + y;
(* val add = fn : int * int -> int *)
#+END_SRC

When you call =add (3, 4)=, you are passing a single tuple =(3, 4)= from the Cartesian product =int * int= into the function.

**** Uncurried Functions and Cartesian Products

In the uncurried approach, a function takes a single argument that happens to be a tuple. 

- *SML Type*: =int * int -> int=
- *Mathematical Relation*: A mathematical function is a specific type of binary relation. For an uncurried function taking two arguments, we define a mapping $f: X \times Y \to Z$. 
- *Set Theory Perspective*: This function is a subset of the Cartesian product $(X \times Y) \times Z$. Each element of the relation is an ordered pair where the first element is itself an ordered pair $(x, y)$ from $X \times Y$, and the second is the result $z$ from $Z$.

#+BEGIN_SRC sml
(* Uncurried addition *)
fun add_uncurried (x, y) = x + y;
(* val add_uncurried = fn : int * int -> int *)

val result = add_uncurried (3, 4);
#+END_SRC



**** Curried Functions and Higher-Order Mapping

Currying (named after logician Haskell Curry) transforms a function that takes a tuple into a sequence of functions, each taking a single argument. This is the default behavior you see in languages like Haskell, but in SML, you define it explicitly.

- *SML Type*: =int -> int -> int= (which groups right-associatively as =int -> (int -> int)=)
- *Mathematical Relation*: Instead of mapping a Cartesian product to a value, a curried function maps a single value to *another function*. Mathematically, this is $f: X \to (Y \to Z)$. 
- *Set Theory Perspective*: If $Z^Y$ denotes the set of all functions from $Y$ to $Z$, our curried function is an element of $(Z^Y)^X$. When you apply the first argument $x \in X$, the relation yields a new function $g: Y \to Z$.

#+BEGIN_SRC sml
(* Curried addition *)
fun add_curried x y = x + y;
(* val add_curried = fn : int -> int -> int *)

(* Partial application is now possible *)
val add_three = add_curried 3;
(* val add_three = fn : int -> int *)

val result = add_three 4;
#+END_SRC

**** The Mathematical Isomorphism

The relationship between these two approaches is a fundamental isomorphism in set theory and logic. The set of functions from a Cartesian product is in one-to-one correspondence with the set of functions returning functions:

$$Z^{X \times Y} \cong (Z^Y)^X$$

This means any uncurried function can be mechanically translated into a curried function, and vice versa, without losing any structural information or expressive power.

#+INCLUDE: "./footer.org" :minlevel 1

* Footnotes

[fn:1] In math $x = x +1$ is an absurdity. Simplifying we would have
$0 = 1$. Crazy.

[fn:2] ...all the memory shiftings and  overwrites...

[fn:3] Standard ML is the original functional language based on type
theory. After SML came Ocaml, Haskell, and F#.

[fn:4] In the Lisp family, a **form** is any part of the code that
can, taken by itself, produce a value.

[fn:5] ...also called **normal form** in higher math.

[fn:6] ~Int.max(a, b)~ is a built-in SML function that takes a tuple
of two arguments and returns the one with the greater value.

[fn:7] $\mathfrak{Fazit}$ (fah-**tzeet**, i.e., Mozart z) is German
for /bottom line/ or /all in all/, a nod to all the German
contributions to math.

[fn:8] Technically, SML functions only ever take one argument at a
time. It only seems to take multiple arguments by packaging them
inside a tuple. Read on about /currying/...
